In [3]:
import pandas as pd
df = pd.read_excel("C:\\Users\\admin\\Desktop\\vvk\\Book1.xlsx")
df

       city  temperature  score  rank
0    mumbai           26      3     1
1  banglore           23     43     4
2     delhi           21      4     2
3   chennai           29      5     5
4     kochi           27      8     3
5   calicut           27     15     6

In [5]:
df = pd.read_excel("C:\\Users\\admin\\Desktop\\vvk\\Book1.xlsx","Sheet2")
df

Empty DataFrame
Columns: [123, 123.1]
Index: []

In [2]:
df = pd.read_excel("C:\\Users\\admin\\Desktop\\vvk\\Book1.xlsx","Sheet1")
df

NameError: name 'pd' is not defined

In [4]:
import pandas as pd
df = pd.read_excel("C:\\Users\\admin\\Desktop\\vvk\\Book1.xlsx","Sheet1")

In [5]:
df

       city  temperature  score  rank
0    mumbai           26      3     1
1  banglore           23     43     4
2     delhi           21      4     2
3   chennai           29      5     5
4     kochi           27      8     3
5   calicut           27     15     6

In [8]:
dic= {"sl.no":[1,2,3],"temperature":[23,45,34],"city":["kochi","banglore","calicut"]}
df = pd.DataFrame(dic)
df

   sl.no  temperature      city
0      1           23     kochi
1      2           45  banglore
2      3           34   calicut

In [13]:
a= [1,2,3]
df= pd.DataFrame(a,columns=["day"])
df

   day
0    1
1    2
2    3